#Первая программа
print('Привет, мир!')
print('Привет вновь!')
print('Мне нравится это печатать.')
print('Ура! Я печатаю!')
print('Это весело!')
print('Это занятие как "волшебство".')
print('Я бы "сказал", что это круто!')

#Практические задания
print()
#1 Добавить свою строку
print('Привет, мир!')
print('Привет вновь!')
print('Мне нравится это печатать.')
print('Ура! Я печатаю!')
print('Это весело!')
print('Это занятие как "волшебство".')
print('Я бы "сказал", что это круто!')
print('Все эти упражнения способствуют запоминанию команд Python')
print()

#2 Вывести только одну строку из всего сценария
#print('Привет, мир!')
#print('Привет вновь!')
#print('Мне нравится это печатать.')
#print('Ура! Я печатаю!')
print('Это весело!')
#print('Это занятие как "волшебство".')
#print('Я бы "сказал", что это круто!')
#print('Все эти упражнения способствуют запоминанию команд Python')

#3 Символ '#' предназначен для создания комментариев
