#Числа и математика
print('Я подсчитаю свою живность:')

print('Куры', 25 + 30 / 6)
print('Петухи', 100 - 25 * 3 % 4)

print('А теперь подсчитаю яйца:')

print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 +6)

print('Верно ли, что 3+2<5-7')

print(3 + 2 < 5 - 7)

print('Сколько будет 3+2?', 3 + 2)
print('А сколько будет 5-7?', 5 - 7)

print('Ой, я кажется запуталась... Почему False?')

print('Еще раз подсчитаю...')

print('Это больше?', 5 > -2)
print('А это больше или равно?', 5 >= -2)
print('А это меньше или равно?', 5 <= -2)

#Практические задания
print()
#1 Подписать комментарий к каждой строчке кода
print('Я подсчитаю свою живность:') # Вывод строки со словами "Я подсчитаю свою живность:".

print('Куры', 25 + 30 / 6) # Вывод строки с названием животного и его количество (число с плавающей точкой).
print('Петухи', 100 - 25 * 3 % 4) # Вывод строки с названием животного и его количество.

print('А теперь подсчитаю яйца:') # Вывод строки со словами "А теперь подсчитаю яйца:".

print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6) # Вывод строки с количеством яиц - результат вычисления.

print('Верно ли, что 3 + 2 < 5 - 7?') #Вывод строки со словами "Верно ли, что 3+2<5-7?".

print(3 + 2 < 5 - 7) # Вывод надписи "False", так как математическое выражение неверно.

print('Сколько будет 3+2?', 3 + 2) # Вывод текста вопроса и вычисленного результата.
print('А сколько будет 5-7?', 5 - 7) # Вывод текста вопроса и вычисленного результата.

print('Ой, я кажется запуталась... Почему False?') # Вывод строки со словами "Ой, я кажется запуталась... Почему False?".

print('Еще раз подсчитаю...') # Вывод строки со словами "Еще раз подсчитаю...".

print('Это больше?', 5 > -2) # Вывод текста вопроса и надписи "True", так как математическое выражение верно.
print('А это больше или равно?', 5 >= -2) # Вывод текста вопроса и надписи "True", так как математическое выражение верно.
print('А это меньше или равно?', 5 <= -2) # Вывод текста вопроса и надписи "False", так как математическое выражение неверно.
print()

#2 ВАЖНО! Если при делении с остатком делимое меньше делителя,
#  то их неполное частное равно нулю, остаток равен делимому.
# Пример:
print('Какой остаток будет, если делимое меньше делителя?')
print('Например, разделим 7 / 9 по модулю.')
print('В программе напишем: 7 % 9')
print('Получим следующий ответ:', 7 % 9)
print('Следовательно, ОСТАТОК=ДЕЛИМОЕ')
print('Если делимое больше делителя как, например, здесь: 9 / 7')
print('Тогда получим следующий остаток:', 9 % 7)
print()

#3 Придуманные мной примеры
print(100 / 23 * 14 - 128)
print(90 % 112)
print(90 / 112)
print(112 * 16 >= 112)
print(112 * 16 <= 16)
print()

#4 Использование чисел с плавающей точкой
# При использовании деления появляются числа с плавающей точкой
print('Я подсчитаю свою живность:')

print('Куры', 25 + 30 / 6)
print('Петухи', 100 - 25 * 6 / 3)

print('А теперь подсчитаю яйца:')

print(3 + 2 + 1 - 5 + 4 - 1 / 4 + 6)

print('Верно ли, что 3 + 2 < 5 - 7')

print(3 + 2 < 5 - 7)

print('Сколько будет 3 + 2?', 3 + 2)
print('А сколько будет 5 - 7?', 5 - 7)

print('Ой, я кажется запуталась... Почему False?')

print('Еще раз подсчитаю...')

print('Это больше?', 5 > -2)
print('А это больше или равно?', 5 >= -2)
print('А это меньше или равно?', 5 <= -2)
